[
  "2025-09-21T17:48:29.000Z|5 Signs the 2025 Altseason Could Be Bigger Than Ever: Indicators, Charts, and Forecasts",
  "2025-09-21T17:30:08.000Z|$350 Million for 0G Labs",
  "2025-09-21T17:13:07.000Z|Arthur Hayes Believes Crypto Will Soar Once the Treasury Hits 850 Billion",
  "2025-09-21T17:01:37.000Z|Solana Could Be “Next in Line” for Institutional Adoption, Says Pantera Capital",
  "2025-09-21T17:00:14.000Z|Trump’s World Liberty Financial tokens traced to North Korea, Iran – Report",
  "2025-09-21T16:57:00.000Z|Publicly traded Gemini holds $464 MILLION Bitcoin on its balance sheet",
  "2025-09-21T16:55:33.000Z|Gold, Bitcoin Set for Higher Prices As Geopolitical Tensions Rise, According to Trader That Called 2021 Market Cycle Top",
  "2025-09-21T16:52:27.000Z|Pro-XRP Lawyer Reveals Why XRP Price Has Taken A Hit Despite Strong ETF Launch",
  "2025-09-21T16:27:37.000Z|Pump.fun Price Prediction 2025-2031: Will PUMP Price Hit $1 in the Next Bull Run?",
  "2025-09-21T16:19:17.000Z|HBAR Price Breakout Unlikely As Bullish Momentum Fades",
  "2025-09-21T16:01:00.000Z|$BNB I've been mentioning in my video's several times that I have been expecting BNB to run to $1000+ and for it to likely also fuel an on chain BSC season. \n\nIt does seem like we're in that phase now as many BSC ecosystem coins are moving big. This is the first time in a long",
  "2025-09-21T16:00:53.000Z|Tether’s USDT market cap hits $172 billion setting new record",
  "2025-09-21T16:00:01.000Z|Jeff Booth's Insights: Investment Strategies & Market Analysis",
  "2025-09-21T16:00:01.000Z|Has Bitcoin’s 4-Year Cycle Just Been Broken?",
  "2025-09-21T15:30:00.000Z|Hamster Kombat Daily Combo 22 September 2025: Play To Earn",
  "2025-09-21T15:26:03.000Z|What comes first for Bitcoin: $120K or $110K? 🤔",
  "2025-09-21T15:22:00.000Z|Bitcoin (BTC) Price Prediction for September 21",
  "2025-09-21T15:16:54.000Z|Trump's Relentless Attacks on Fed May Deepen Policy Lag, Send USD Lower",
  "2025-09-21T15:14:03.000Z|Bitcoin traders have these BTC price levels in mind at $116K",
  "2025-09-21T15:13:06.000Z|XLM Price Scenarios 2026: The Future Value of 7,488 Stellar Tokens",
  "2025-09-21T18:11:46.000Z|First Chinese CNH stablecoin debuts as global race heats up",
  "2025-09-21T18:10:22.000Z|OKX's New Strategy for DEX Trading on Web3 Platform",
  "2025-09-21T18:08:18.000Z|Prediction Markets and DAOs Are Cousins, Says Syndicate Co-Founder",
  "2025-09-21T18:00:51.000Z|Stablecoin Adoption Accelerates as Corporates Embrace GENIUS Act Clarity",
  "2025-09-21T18:00:34.000Z|Bitcoin Spam Wars: Inside the Battle for Bitcoin's Future",
  "2025-09-21T18:00:31.000Z|Bitcoin Price On The Verge Of Explosive Move: Here’s The Only Condition",
  "2025-09-21T17:30:00.000Z|BNB Price Hits Another All-Time High, But Correction Risk Looms",
  "2025-09-21T17:00:49.000Z|Shiba Inu Ecosystem Shaken as Bridge Breach Leaves Funds Stranded",
  "2025-09-21T16:30:31.000Z|Analyst Says 2025 Altcoin Rally Could Mirror Past Surges – Here is Why",
  "2025-09-21T16:30:00.000Z|Marina Protocol Quiz Answer Today 22 September 2025: Earn Coins",
  "2025-09-21T18:45:56.000Z|Crypto Custody Firm BitGo’s Revenue Nearly Quadruples to $4,190,000,000 in First Half of 2025: Report",
  "2025-09-21T18:28:14.000Z|Wall Street legend reveals 'massively underestimated' asset",
  "2025-09-21T18:39:12.000Z|Crypto.com’s Alleged Breach Renews Debate Over Exchange Transparency",
  "2025-09-21T19:03:58.000Z|Here Is What Vitalik Buterin Thinks Will Secure Ethereum’s Future",
  "2025-09-21T18:45:52.000Z|North Korean Hackers Hit Crypto Sector With BeaverTail Malware",
  "2025-09-21T19:00:01.000Z|Does S&P Rejection KILL MicroStrategy? | Preston Pysh",
  "2025-09-21T18:29:52.000Z|What is Crypto Options Trading and How You Can Make High Profits With It",
  "2025-09-21T19:28:40.000Z|Low-risk DeFi, not memecoins, can best sustain Ethereum’s economy, co-founder Vitalik Buterin says",
  "2025-09-21T17:30:00.000Z|Xenea Wallet Daily Quiz Answer Today 22 September 2025: Win Coins",
  "2025-09-21T20:14:12.000Z|Traditional economies are being &#039;sunset,&#039; in favor of the internet — VC",
  "2025-09-21T20:02:00.000Z|$BTC The current ~10% displacement from the monthly low to monthly high would be the smallest monthly move in 2 years.\n\nThis makes it so it's very likely that either the monthly high or low still gives in this month.\n\nObviously with price trading where it is, a break of the",
  "2025-09-21T20:01:28.000Z|Nvidia’s $5B stake won’t fix Intel’s biggest headache, which is manufacturing losses",
  "2025-09-21T20:00:30.000Z|Ethereum: 3 key factors signaling ETH’s road ahead",
  "2025-09-21T20:00:21.000Z|Citi Unveils Fed Rate Cut Playbook for Stocks, Predicts Incoming ‘Goldilocks’ Scenario for US Economy",
  "2025-09-21T20:00:21.000Z|Bitcoin's Core Development: Freedom vs. Authoritarianism",
  "2025-09-21T20:00:00.000Z|Arthur Hayes Capitulates on HYPE as CZ’s Aster Jolts Hyperliquid",
  "2025-09-21T19:51:29.000Z|OKX could have launched its own Hyperliquid DEX since 2023, founder claims",
  "2025-09-21T19:39:45.000Z|London’s crypto robbers plague streets via stolen phones packed with wallet data",
  "2025-09-21T19:30:00.000Z|Cardano Whales Delay ADA Price Push To $1",
  "2025-09-21T19:00:00.000Z|Has Tether’s USDT Stablecoin Become the Dollar Bolivia Actually Trusts?",
  "2025-09-21T19:00:00.000Z|Gold vs Bitcoin: Performance Through the Lens of Money Supply",
  "2025-09-21T20:33:42.000Z|Ethereum Rainbow Chart predicts ETH price for October 1, 2025",
  "2025-09-21T18:30:00.000Z|ARI Wallet Daily Quiz Answer Today 22 September 2025: Win Rewards",
  "2025-09-21T20:30:47.000Z|Biggest bitcoin fraud trial could redefine crypto justice in the UK",
  "2025-09-21T20:41:03.000Z|China Sentences Four in Crypto Money Laundering Case",
  "2025-09-21T21:00:54.000Z|Crypto Regulation Hits Partisan Roadblock in the Senate",
  "2025-09-21T20:50:25.000Z|Tether’s CEO reports Bolivian auto dealers now accept USDT",
  "2025-09-21T21:35:38.000Z|Previously unreported attack on Crypto.com leaked users’ personal data: Bloomberg",
  "2025-09-21T19:40:24.000Z|Ethereum Staking Incident Highlights Cardano’s Strengths – Is Staking Crypto Safe?",
  "2025-09-21T19:30:00.000Z|Dropee Daily Combo And Question of the Day 22 September 2025",
  "2025-09-21T21:12:28.000Z|Is Charity the New Utility for Meme Coins? Binance’s Changpeng Zhao Thinks So",
  "2025-09-21T21:00:00.000Z|Ethereum Holders Keep Price Afloat At $4,500 – Here’s What’s Next For ETH",
  "2025-09-21T22:00:19.000Z|Traders are shorting Ethereum, but a surprise rally can come instead",
  "2025-09-21T21:00:00.000Z|Coinbase CEO: 'We Want to Become a Super App and Provide All Types of Financial Services'",
  "2025-09-21T22:03:20.000Z|Jimmy Song slams Bitcoin Core devs for &#039;fiat&#039; mentality on OP_Return",
  "2025-09-21T22:01:32.000Z|U.S. deficit will top $2 trillion in FY 2025, even with record $350B in tariffs",
  "2025-09-21T22:00:52.000Z|Bitcoin KNOTS Adoption Shock: Guardrails, Not Censorship!",
  "2025-09-21T22:34:42.000Z|EU finance ministers set roadmap to launch digital euro, though issuance could take years: Reuters",
  "2025-09-21T22:30:04.000Z|Crypto Custodian Aims for Historic Step Into Federal Reserve System",
  "2025-09-21T20:30:00.000Z|TON Station Daily Combo Today 22 September 2025: Win SOON Points!",
  "2025-09-21T22:47:13.000Z|The Funding: DATs have raised $20 billion, but have they peaked? What’s next?",
  "2025-09-21T23:00:25.000Z|Binance Smart Chain Q3 fees surge to $357 mln – Traders bet big on BNB!",
  "2025-09-21T22:29:19.000Z|BNB Extends Gains as Market Eyes Next Breakout With $1,250 Target",
  "2025-09-21T22:15:12.000Z|Paolo Ardoino Says Bitcoin is Certainty Ahead of Political Bombshell Teased for Tuesday",
  "2025-09-21T23:00:45.000Z|Is Altseason Here? This is What You Need to Know",
  "2025-09-21T23:44:00.000Z|This Week in Crypto News: Everything You Need To Know",
  "2025-09-21T23:40:01.000Z|Trump and Musk Reconcile at Charlie Kirk Memorial",
  "2025-09-21T21:30:00.000Z|CEX.IO Daily Quiz Answer Today 22 September 2025: Revealed",
  "2025-09-22T00:41:02.000Z|Digital Asset Treasury Raises $20 Billion, Focus Shifts",
  "2025-09-22T00:09:26.000Z|EU Compromise on Digital Euro Roadmap Finalized",
  "2025-09-22T00:00:40.000Z|Real Economics: Not Indoctrination! Free Market Thinkers",
  "2025-09-22T00:00:39.000Z|Nasdaq-Listed Cannabis Firm Makes Bold Pivot Into Blockchain and AI",
  "2025-09-22T00:00:00.000Z|Why World Thinks the Internet Can’t Survive Without Proof of Human",
  "2025-09-21T22:58:47.000Z|Bitcoin Stalls on Rate Cut as Hopes Fade—Will This Week Be Different?",
  "2025-09-22T01:09:17.000Z|Toyota, Yamaha, BYD accept Tether in Bolivia as USD reserves shrink",
  "2025-09-22T00:49:02.000Z|Ray Dalio: Global Economic War Has Begun! | Can Bitcoin Win?",
  "2025-09-22T00:00:03.000Z|Analyst Michaël van de Poppe Says Ethereum-Based Altcoin Flashing ‘One of the Best Setups’ in Crypto, Updates Outlook on VET and W",
  "2025-09-21T23:30:00.000Z|Syntax Verse Daily Quiz Answer 22 September 2025: Answer Inside!",
  "2025-09-21T23:30:00.000Z|Spell Wallet Daily Puzzle Today 22 September 2025: Earn Reward",
  "2025-09-22T02:01:02.000Z|Kaia and LINE Next to Launch Asia's ‘Universally Compliant’ Stablecoin Super-App",
  "2025-09-22T01:53:33.000Z|Bitcoin, Ethereum, Dogecoin, XRP Dive As Crypto Enters 'Fear' Zone: Analyst Says BTC 'Always Follows' Gold As Precious Metal Charts New Highs",
  "2025-09-22T02:10:51.000Z|Uniswap Founder Sparks Debate Over Governance Token Model",
  "2025-09-22T01:57:19.000Z|Asia Morning Briefing: China’s Car, America’s Currency — Why Stablecoins Keep the Dollar in the Driver’s Seat",
  "2025-09-22T02:15:52.000Z|Wall Street sticks with mid-curve Treasuries as Fed path stays murky",
  "2025-09-22T09:30:07.000Z|XRP wipes out $11 billion in market value overnight",
  "2025-09-22T09:29:37.000Z|What Happens If the Corporate Bitcoin Rush Backfires?",
  "2025-09-22T09:25:00.000Z|Crypto Trading Psychology: Overcoming FOMO, Fear, and Loss Aversion",
  "2025-09-22T09:24:24.000Z|South Korea flags record suspicious crypto transactions in 2025: Report",
  "2025-09-22T09:17:29.000Z|Teen Hacker Infiltrated Crypto.com Employee Account",
  "2025-09-22T09:15:18.000Z|Billionaire Jeffrey Gundlach Warns Bitcoin Has ‘Lost Its Momentum,’ Says BTC Not a Very Good Investment",
  "2025-09-22T09:14:30.000Z|Bitcoin Price Dips to $112K as Analysts Spot Accumulation Zone",
  "2025-09-22T09:13:01.000Z|XRP Holders Can Now Earn Up to 8% Through New Liquid Staking Token",
  "2025-09-22T09:06:22.000Z|Fed, PCE Data, and Hedera Upgrade Set Crypto Market Tone",
  "2025-09-22T09:01:48.000Z|Weekly HBAR chat/discussion thread!",
  "2025-09-22T09:00:23.000Z|Altcoin Market Shows Signs of Bottoming Out",
  "2025-09-22T09:00:20.000Z|Bitcoin's Rise: BRICS Nations' Bold Strategy Unveiled!",
  "2025-09-22T08:55:25.000Z|Eric Trump Said A Fed Rate Cut Would Result In Crypto Skyrocketing, But The Majority Of Polymarket Bettors Have A Sobering View On Bitcoin",
  "2025-09-22T08:49:10.000Z|Ether price forecast: ETH could dip below $4k as indicators lean bearish",
  "2025-09-22T08:46:59.000Z|Kaia and LINE NEXT unveil stablecoin-powered super-app to expand Asia’s Web3 market",
  "2025-09-22T08:46:28.000Z|Asia Drives Crypto Growth as Market Power Shifts East",
  "2025-09-22T08:44:28.000Z|Biggest long liquidation of 2025: 5 things to know in Bitcoin this week",
  "2025-09-22T08:42:54.000Z|Maelstrom warns HYPE token facing pressure with $11.9B unlocks ahead",
  "2025-09-22T08:40:50.000Z|OKX Announces Upcoming Delisting of LUNC and USTC Trading Pairs",
  "2025-09-22T08:36:49.000Z|GENIUS Act drives stablecoin adoption: $2.1–$4.2T in payments",
  "2025-09-22T09:43:42.000Z|Bolivia: Toyota, Yamaha, and BYD accept USDT to tackle dollar shortage",
  "2025-09-22T09:43:24.000Z|5,419 BTC Acquisition Pushes Metaplanet’s Holdings to $2.71 Billion Portfolio Value",
  "2025-09-22T09:40:06.000Z|What's Next After Bitcoin's Flash Crash To Below $113,000",
  "2025-09-22T09:37:14.000Z|Binance’s Giggle Academy receives GIGGLE token donations, warns it will sell in full",
  "2025-09-22T09:36:38.000Z|South Africa’s Sygnia Warns Investors Against Going All-In on Bitcoin ETF",
  "2025-09-22T09:33:56.000Z|Crypto Leverage Whipeout: $600M+ In BTC & ETH Longs Liquidated",
  "2025-09-22T09:24:02.000Z|XRP falls 6% to $2.81 as bearish channel signals more downside",
  "2025-09-22T10:30:42.000Z|Pi Network’s Price Tanks to a New All-Time Low: Is There Any Hope Left for PI?",
  "2025-09-22T10:27:43.000Z|Why Stablecoins Have a Huge Opportunity to Attract Millions of Users",
  "2025-09-22T10:25:43.000Z|UK FCA bows to criticisms, promises faster operation",
  "2025-09-22T10:22:00.000Z|Massive $415 Million XRP Transfer Hits Ledger, Ripple Rumors Follow",
  "2025-09-22T10:18:48.000Z|Crypto funds see $1.9B inflows as Bitcoin ETFs extend streak",
  "2025-09-22T10:15:33.000Z|Ronin Treasury Turns to RON as It Returns to Ethereum",
  "2025-09-22T10:11:50.000Z|B HODL Plc Launches on Aquis for Bitcoin Accumulation",
  "2025-09-22T10:10:15.000Z|$BTC No gap was created this weeked yet again. Price traded perfectly where it ended at on Friday by the time futures re-opened.\n\nOnly after futures re-opened is when the sell off began and price started accelerating downwards.\n\nWeekends remain a good place to mark out your",
  "2025-09-22T10:09:39.000Z|UK plans visa fee cuts to attract global talent and grow its economy",
  "2025-09-22T10:07:55.000Z|Bitcoin shows signs of ‘cycle exhaustion’ as BTC price tumbles to $112K",
  "2025-09-22T10:07:46.000Z|Pudgy Pandas presale raises over $2.3M: price set to jump 12% in 2 days",
  "2025-09-22T10:04:17.000Z|Binance to Feature Anoma (XAN) on Binance Alpha and Binance Futures With 50x Leverage",
  "2025-09-22T10:02:47.000Z|DOGE News Today: Dogecoin Price Slides 10% Amid Sell-Off and Liquidations",
  "2025-09-22T10:01:36.000Z|5 Stocks Ready to Skyrocket in October 2025",
  "2025-09-22T10:00:58.000Z|Bitcoin Price: Traders Brace for October’s Make-or-Break Moment",
  "2025-09-22T10:00:06.000Z|EU, 'Chat Control' proposal puts privacy and the crypto sector at risk",
  "2025-09-22T10:00:02.000Z|New Video!\n\n''The Market is Compressing Again. Is a big move ahead?'' Is what my title was when recording this. \n\nApologies for the market changing this much in a day but we did talk about the levels that got hit for the likes of $BTC &amp; $ETH and what my line in the sand would",
  "2025-09-22T10:00:00.000Z|HBAR’s Week Ahead Looks Bleak as Hedera Stablecoin Market Cap Crashes 50%",
  "2025-09-22T09:58:41.000Z|Crypto Inflows Near $2 Billion as Fed Rate Cut Sparks Renewed Demand",
  "2025-09-22T09:56:25.000Z|Arthur Hayes sells $5.1M in HYPE weeks after bold 126x prediction",
  "2025-09-22T10:37:52.000Z|Crypto investment products draw $1.9 billion in weekly inflows after Fed rate cut: CoinShares",
  "2025-09-22T10:35:20.000Z|Please help",
  "2025-09-22T10:28:30.000Z|361 Degrees Explores Stablecoin Payments",
  "2025-09-22T10:28:00.000Z|JustLendDAO Lowers Energy Rental Barrier! Win More DeFi Alpha with Cheaper TRON Gas",
  "2025-09-22T10:24:05.000Z|Today was the largest nominal $ETH liquidation since May 2021 when price dropped -45% in a single day.",
  "2025-09-22T11:36:28.000Z|Japanese Giant Metaplanet Bought $632M in Bitcoin",
  "2025-09-22T11:35:13.000Z|Chinese Regulators Crack Down on Real-World Asset Businesses – What It Means for Tokenized Assets",
  "2025-09-22T11:30:17.000Z|Crypto.com CEO Rejects Claims of Cover-Up in 2023 Breach",
  "2025-09-22T11:27:00.000Z|Binance to Delist This Meme Coin Perpetual Contract: Details",
  "2025-09-22T11:23:34.000Z|Join the TalkBinance Campaign: Share Your Thoughts & Earn Rewards!",
  "2025-09-22T11:18:41.000Z|Ethereum Plummets Below $4,200: Is The ETH Bull Run Over?",
  "2025-09-22T11:17:07.000Z|Why Crypto Is Set to Reach 4 Billion Users Faster Than the Internet?",
  "2025-09-22T11:15:08.000Z|Crypto.com team ‘covered up a breach’ – Scattered Spider breach, revealed!",
  "2025-09-22T11:15:00.000Z|Bitcoin Drops, Ether Sinks and There's Little Sign of Support: Crypto Daybook Americas",
  "2025-09-22T11:11:00.000Z|Can Bitcoin Korean Premium Trigger BTC Price Rebound?",
  "2025-09-22T11:07:33.000Z|Metaplanet purchased 5,419 BTC, securing 85% of its year-end Bitcoin target",
  "2025-09-22T11:00:27.000Z|XRP Goes Head-To-Head With Bitcoin In This Metric As South Korean Market Wakes Up",
  "2025-09-22T11:00:01.000Z|Bitcoin: 1000x Your Money? Saudi Arabia's Big Bet!",
  "2025-09-22T11:00:00.000Z|Midas and Axelar launch mXRP, a tokenized XRP product, targeting up to 8% base yield",
  "2025-09-22T11:00:00.000Z|Crypto.com Capital invests in Moonlander to boost decentralized derivatives on Cronos",
  "2025-09-22T10:58:21.000Z|Dogecoin, Solana and Ethereum Plunge as Crypto Liquidations Near $1.7B",
  "2025-09-22T10:55:37.000Z|Fed's Preferred Inflation Gauge On The Radar",
  "2025-09-22T10:49:35.000Z|MrBeast accused of $23M crypto insider trading",
  "2025-09-22T10:47:29.000Z|Crypto Prices Crash with $1.7B Liquidation Wipeout: Is the Bull Market Over?",
  "2025-09-22T10:46:40.000Z|Musk's X Exposes Massive Crypto Bribery Network",
  "2025-09-22T11:33:56.000Z|Shiba Inu price drops 6% as governance and DeFi plans advance",
  "2025-09-22T11:23:23.000Z|Pi Network price forecast as crypto bloodbath sinks altcoins",
  "2025-09-22T11:47:34.000Z|Jim Cramer slams crypto and gold as Bitcoin erases $1B in longs",
  "2025-09-22T11:45:50.000Z|Minnesota Authorities Say State’s Housing Stability ‘Riddled With Fraud,’ Eight Charged With Multi-Million-Dollar Scams",
  "2025-09-22T11:40:18.000Z|Markets price in 92% chance of another Federal Reserve rate cut in October",
  "2025-09-22T11:50:36.000Z|Meme Coin Mania Fuels $1.3M in Donations for CZ’s Giggle Academy Education Platform",
  "2025-09-22T11:50:30.000Z|Why Kenvue Stock Is Down in Premarket Today: Trump Team Targets Tylenol–Autism Link",
  "2025-09-22T11:50:15.000Z|Gold surges to new all-time high above $3,726 as Fed cut bets grow",
  "2025-09-22T11:30:00.000Z|3 Altcoins To Watch In The Fourth Week Of September 2025",
  "2025-09-22T11:13:44.000Z|Korea’s FIU Sounds Alarm as Suspicious Crypto Reports Double in 2025",
  "2025-09-22T11:42:51.000Z|Dogecoin price crashes 11% as bears wipe $1.6B off the crypto market",
  "2025-09-22T12:02:57.000Z|Crypto crash: $1.7 billion in derivative positions liquidated",
  "2025-09-22T12:00:53.000Z|Dogecoin: Why this cycle can have DOGE’s most sustainable rally yet",
  "2025-09-22T12:01:30.000Z|BREAKING: Michael Saylor's STRATEGY buys 850 Bitcoin worth $96 MILLION",
  "2025-09-22T12:05:00.000Z|Michael Saylor’s Firm Adds 850 BTC, Hits 26% Yield in 2025",
  "2025-09-22T12:05:13.000Z|Strategy adds 850 bitcoin for $100 million as total holdings reach 639,835 BTC",
  "2025-09-22T12:00:23.000Z|China holds benchmark lending rates steady for fourth month",
  "2025-09-22T12:03:39.000Z|China regulator tells brokerages to pause RWA tokenization efforts in Hong Kong: Reuters",
  "2025-09-22T11:46:08.000Z|Cramer Says He Would Like Endless Crypto Rally to Pause",
  "2025-09-22T12:10:40.000Z|Helius Medical Acquires Solana Tokens for Digital Asset Strategy",
  "2025-09-22T12:06:51.000Z|FCA plans exemptions for crypto companies",
  "2025-09-22T12:12:23.000Z|Bond King Sounds Alarm on Bitcoin’s Future",
  "2025-09-22T12:13:40.000Z|Michael Saylor’s Strategy acquires $100M in Bitcoin amid Fed rate cut",
  "2025-09-22T12:10:02.000Z|Crypto․com did not cover up 2023 hack, CEO refutes ZachXBT claims",
  "2025-09-22T12:05:17.000Z|BYD gains ground in Spain with low-priced EVs",
  "2025-09-22T12:22:16.000Z|Why Is Crypto Down Today? – September 22, 2025",
  "2025-09-22T12:21:12.000Z|48% of Ethereum EIP-7702 uses linked to crime, says Wintermute",
  "2025-09-22T12:16:02.000Z|Michael Saylor's STRATEGY now holds 639,835 Bitcoin worth $72 BILLION",
  "2025-09-22T12:30:54.000Z|Binance delists NEIRO: Panic selling causes 25% crash",
  "2025-09-22T12:24:59.000Z|Hyperliquid whale withdraws $122M HYPE tokens as Arthur Hayes exits",
  "2025-09-22T12:16:10.000Z|DeFi Development Strikes ZeroStack Deal To Drive Solana Into Decentralized AI",
  "2025-09-22T12:30:28.000Z|Bitcoin Stuck In Neutral While Markets Roar — Analyst Explains Why",
  "2025-09-22T12:25:43.000Z|Sony prices financial unit spinoff at $1 ahead of TSE debut",
  "2025-09-22T12:23:21.000Z|Fragmetric to launch first Solana DAT for the South Korean market",
  "2025-09-22T12:15:44.000Z|China’s tech finds new lifelines beyond U.S. borders",
  "2025-09-22T12:18:05.000Z|Strategy Added 850 Bitcoin for Nearly $100M Last Week",
  "2025-09-22T12:35:56.000Z|47.3B XRP in Whale Hands — $2.70 Becomes the New Floor",
  "2025-09-22T12:35:42.000Z|Solana Pushes Into South Korea With Bold New Corporate Treasury Plan",
  "2025-09-22T12:36:00.000Z|Largest Crypto Liquidation Since 2024: $1.7 Billion Gone, XRP and Bitcoin Hammered",
  "2025-09-22T12:42:06.000Z|$1B Liquidated as Bitcoin Hits 12-Day Lows, Casting Doubt on ‘Uptober’ Rally – is BTC Dead?",
  "2025-09-22T12:39:46.000Z|Strive, Inc. Acquires Semler Scientific in Stock Deal",
  "2025-09-22T12:37:45.000Z|Particle Network, Jupiter lead $517 million token unlock this week",
  "2025-09-22T12:41:18.000Z|Aave price slides 10% as bearish momentum sweeps crypto",
  "2025-09-22T12:26:27.000Z|South Korea sees record surge in suspicious crypto transactions in 2025",
  "2025-09-22T12:20:00.000Z|Pi Network Serves Key KYC Update: What Pioneers Must Know",
  "2025-09-22T12:41:00.000Z|UAE signs agreement for automatic exchange of crypto tax data",
  "2025-09-22T12:40:30.000Z|ALERT: $1.6 BILLION Bitcoin and crypto long liquidations over the past 24 hours",
  "2025-09-22T12:28:20.000Z|JUST IN: Vivek Ramaswamy's Strive to acquire Bitcoin treasury company Semler Scientific \n\nThe combined company will hold 10,900 BTC.",
  "2025-09-22T12:50:58.000Z|Billionaire Michael Saylor Purchases 850 BTC at $117K, Total Holdings at 639K BTC",
  "2025-09-22T12:50:58.000Z|BitMine’s Ethereum holdings top 2% of supply with 2.4 million ETH",
  "2025-09-22T12:51:18.000Z|XRP can no longer blame SEC case for price dips, Ripple lawyer Bill Morgan",
  "2025-09-22T12:52:56.000Z|Shibarium Bridge Exploit: Kaal Drops Latest Dev Report Post Hack",
  "2025-09-22T12:54:37.000Z|Bitcoin and Ethereum Hit Multi-Week Lows Amid Mass Liquidations",
  "2025-09-22T13:02:04.000Z|Plasma to Launch Stablecoin-Native Neobank After This Month’s ‘Mainnet Beta’",
  "2025-09-22T13:01:54.000Z|Strategy Joins Metaplanet With Another Bitcoin Purchase",
  "2025-09-22T13:00:23.000Z|OKX Built a Hyperliquid Rival – Then Shelved It",
  "2025-09-22T13:02:29.000Z|MBX Biosciences Stock Skyrockets After Announcing Significant Phase 2 Results",
  "2025-09-22T13:00:00.000Z|Ep. 602 Arjun Bhatnagar | Data Protection Solutions with Cloaked",
  "2025-09-22T12:58:45.000Z|Turkey removes tariffs on U.S. goods paving way for strategic talks",
  "2025-09-22T13:05:00.000Z|Plasma blockchain to launch stablecoin-focused neobank",
  "2025-09-22T13:02:21.000Z|JUST IN: 🇺🇸 Vivek Ramaswamy's Strive just bought its first 5,816 Bitcoin worth $675 MILLION",
  "2025-09-22T12:56:09.000Z|JUST IN: 🇯🇵 Japan's Metaplanet buys 5,419 Bitcoin worth $632 MILLION\n\nNow the 5th largest Bitcoin treasury company",
  "2025-09-22T12:42:45.000Z|Crypto Custodian BitGo Files for US IPO",
  "2025-09-22T13:11:38.000Z|PayPal Ventures Invests in Stable for PYUSD Transactions",
  "2025-09-22T13:00:25.000Z|Digital Money: Banks Won't Tell You This!",
  "2025-09-22T13:16:31.000Z|BNB Smashes Records as Hype Builds Around CZ’s Political Lifeline",
  "2025-09-22T13:14:00.000Z|Key market events to watch this week, as stock investors brace for winter, red trades",
  "2025-09-22T13:09:32.000Z|BLUM BRINGS PERPETUAL FUTURES TO TELEGRAM, OPENING A NEW CHAPTER FOR CRYPTO TRADING",
  "2025-09-22T13:21:29.000Z|12 Real-Life Problems That Blockchain Technology Could Quietly Solve",
  "2025-09-22T13:21:27.000Z|China Launches AxCNH Stablecoin in Bid to Challenge Dollar Dominance",
  "2025-09-22T13:21:24.000Z|Coinbase CEO Aims to Replace Banks With Bold Crypto Super App Vision",
  "2025-09-22T13:21:21.000Z|Toyota and Yamaha Turn to Tether as Bolivia’s Dollar Crisis Deepens",
  "2025-09-22T13:21:18.000Z|Ethereum Needs Its ‘Google Search’? Vitalik Says Low-Risk DeFi Could Be It",
  "2025-09-22T13:08:37.000Z|Binance launches rewards program for Ethena’s USDe stablecoin with 12% APR",
  "2025-09-22T13:30:01.000Z|Why Arthur Hayes sold $5.1 million HYPE tokens because of $12B Hyperliquid concern",
  "2025-09-22T13:35:25.000Z|New XRP Tokenized Product Could Become a Constant Buyer of XRP",
  "2025-09-22T13:32:17.000Z|Vivek Ramaswamy’s Strive to buy Semler Scientific in all-stock deal, boosting combined bitcoin treasury above 10,900 BTC",
  "2025-09-22T13:30:59.000Z|Stablecoin Blockchain Plasma Launches Neobank, Plasma One",
  "2025-09-22T13:30:00.000Z|New regulations expose blockchain&#039;s privacy and compliance gaps",
  "2025-09-22T13:27:32.000Z|Are TGEs becoming the end of blockchains?",
  "2025-09-22T13:11:03.000Z|Bitcoin to Join Gold on Central Bank Reserve Balance Sheets by 2030: Deutsche Bank",
  "2025-09-22T13:21:58.000Z|'I'm Not A Crypto Person At All', Says Billionaire Investor Who Sees Bitcoin's Momentum Stalling",
  "2025-09-22T13:21:30.000Z|Crypto Isn't The Real Threat - It's Regulatory Chaos",
  "2025-09-22T13:39:29.000Z|Crypto.com breach exposed more data than CEO claimed, report",
  "2025-09-22T13:41:59.000Z|Crypto Exchange Coinbase To Become A 'Super App'",
  "2025-09-22T13:40:31.000Z|Stable Integrates PayPal's PYUSD Amid New Funding Round",
  "2025-09-22T13:42:23.000Z|Michael Saylor’s Strategy follows Metaplanet, adding 6,269 BTC worth $729 million",
  "2025-09-22T13:45:33.000Z|Bitcoin Treasury Consolidation Begins with Strive-Semler Merger",
  "2025-09-22T13:47:31.000Z|UAE to adopt global crypto tax reporting framework",
  "2025-09-22T13:30:00.000Z|Coinbase data breach victims mull legal strategy",
  "2025-09-22T13:28:10.000Z|Plasma opens stablecoin bank Plasma One for dollar access",
  "2025-09-22T13:34:01.000Z|JUST IN: Publicly traded Capital B has acquired 551 Bitcoin worth $62.2 MILLION",
  "2025-09-22T13:31:27.000Z|It does appear we chose the wrong market again 🫡\n\n(Usually we'll catch up at some point though, not the first time we've had this in the past few years).",
  "2025-09-22T13:55:11.000Z|Bitcoin Mining in 2025–2026: Beyond the ASIC Arms Race",
  "2025-09-22T13:46:56.000Z|UAE strengthens crypto oversight with tax reporting agreement",
  "2025-09-22T14:00:54.000Z|India Blockchain Month 2025: Delhi to Lead the World in Web3, AI & Real-World Asset Innovation",
  "2025-09-22T14:00:00.000Z|Transak integrates USDG, the first MiCA-compliant stablecoin from Paxos",
  "2025-09-22T13:59:52.000Z|UAE Announces 2027 Rollout of Automatic Crypto Tax Reporting System – What Does it Mean for Investors?",
  "2025-09-22T14:00:20.000Z|As Bitcoin’s sell pressure grows, are investors seeking safety in altcoins?",
  "2025-09-22T13:40:48.000Z|Peter Thiel-backed crypto startup quietly makes big move",
  "2025-09-22T13:53:37.000Z|86 million People to Lose Access to Their Bank Accounts",
  "2025-09-22T14:02:18.000Z|MASSIVE Bitcoin news from the White House rumored for tomorrow. \n\nWhat do you think it will be? 🤔",
  "2025-09-22T13:58:59.000Z|$BTC Was unable to hold on to its ~$116K local support and fell back within the local range. Respected the $112K level perfectly yet again.\n\nIt's clear that we're not done chopping around in this price area which has been the case for the past 2-3 months now.\n\nAll levels from",
  "2025-09-22T14:14:21.000Z|AVAX recovers after AgriFORCE transformation into treasury company",
  "2025-09-22T14:10:00.000Z|Is XRP price going to crash after falling below $3 again?",
  "2025-09-22T14:10:00.000Z|Pi Network’s mystery: Why the hype won’t die despite endless doubts",
  "2025-09-22T14:06:24.000Z|South Korea flags 36,684 suspicious crypto transactions",
  "2025-09-22T14:33:30.000Z|South Korea to get first Solana treasury through DeFi Development Corp and Fragmetric Labs deal",
  "2025-09-22T14:30:46.000Z|Binance-Backed Token Explodes 93% After Going Live on Crypto Exchange and Receiving Shout-Out From Changpeng Zhao",
  "2025-09-22T14:28:37.000Z|Crypto.com CEO Denies Silence on Alleged Hack as CRO Plunges 10%",
  "2025-09-22T14:27:39.000Z|Bitfinex-backed Stable integrates PayPal’s PYUSD stablecoin",
  "2025-09-22T14:23:52.000Z|Australia’s economy holds firm as RBA hints at more rate cuts",
  "2025-09-22T14:23:36.000Z|Why Is SNAP Stock Surging Today?",
  "2025-09-22T14:14:15.000Z|PayPal backs Stable to expand PYUSD",
  "2025-09-22T14:04:01.000Z|UAE Joins Global Tax Transparency Push With Crypto Reporting Framework",
  "2025-09-22T14:01:36.000Z|Will Crypto Pump Hard in 24 Hours? Ethena & Aster Explosive Gains!",
  "2025-09-22T13:59:08.000Z|Ripple advances institutional DeFi with lending and privacy tools",
  "2025-09-22T14:33:00.000Z|MrBeast’s Crypto Trades Spark Insider Allegations After Aster Buy",
  "2025-09-22T14:41:50.000Z|UK-US Task Force to Explore Digital Asset Regulation",
  "2025-09-22T14:39:54.000Z|Synthetix Returning to Ethereum L1 With a Bold New Perp DEX",
  "2025-09-22T14:38:42.000Z|Why Solana (SOL) is set to rally 60%",
  "2025-09-22T14:35:56.000Z|Bitcoin Miner AgriFORCE’s Stock Jumps 200% on $550 Million Avalanche Treasury Move",
  "2025-09-22T14:27:00.000Z|-200,607,300,000 Shiba Inu in 24 Hours: Who's Buying SHIB?",
  "2025-09-22T14:22:35.000Z|AgriFORCE to rebrand as AVAX One in $550M bet on Avalanche Network",
  "2025-09-22T14:16:52.000Z|JUST IN: SkyBridge's Anthony Scaramucci maintains $150,000 Bitcoin target for 2025\n\n\"September lows are typical.\"",
  "2025-09-22T14:44:40.000Z|Ethereum bleeds nearly $40 billion in brutal 24-hour sell-off",
  "2025-09-22T14:41:56.000Z|Bitcoin’s $977M streak outguns Ethereum as $1B altcoin wave returns post Fed cut",
  "2025-09-22T14:48:25.000Z|Strategy Shares Fall After Bitcoin Giant Reveals $100 Million BTC Buy",
  "2025-09-22T14:43:08.000Z|Bookrunner says digital bank NOBA’s IPO has been covered multiple times",
  "2025-09-22T14:33:12.000Z|China’s CSRC asks brokers to pause RWA tokenization business in Hong Kong",
  "2025-09-22T14:54:27.000Z|Strive and Semler Scientific to Merge in All-Stock Deal, Creating Bitcoin Treasury Powerhouse",
  "2025-09-22T14:44:05.000Z|Strive acquires Semler Scientific in Bitcoin-focused merger",
  "2025-09-22T14:57:11.000Z|The largest Bitcoin and crypto liquidation event of the year just happened",
  "2025-09-22T14:43:45.000Z|JUST IN: 🇺🇸🇬🇧 US and UK announce task force to explore crypto regulation cooperation"
]